app/Controllers/EventoController.php

SELECT *
FROM `eventos`
---
    function index(){

        $eventos = $this->eventoModel->findAll();

INSERT INTO `eventos` (`nombreEvento`, `lugar`, `nombreOrganizador`, `cantInvitados`, `fecha`, `created_at`, `updated_at`) VALUES ('Navidad', 'Casa sergio', 'Navidad', '100', '2024-12-25', '2024-11-27 14:21:44', '2024-11-27 14:21:44')
---
    function store(){
        $data= array(
            "nombreEvento" => $this->request->getPost("nombreEvento"),
            "lugar" => $this->request->getPost("lugar"),
            "nombreOrganizador" => $this->request->getPost("nombreEvento"),
            "cantInvitados" => $this->request->getPost("cantInvitados"),
            "fecha" => $this->request->getPost("fecha")
        );

        $this->eventoModel->save($data);